# Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

number=input("Введите день недели: ")
weekend='67'
res=(lambda weekend: number in weekend)(weekend)
print (res)